#language: ru

@tree

Функционал: Тестирование интерфейса Дивиденды, выплаты участникам

Как Администратор я открываю командный интерфейс Дивиденды/Выплаты
и провожу проверку на заранее созданных данных.
Проеряю кнопки, сервисы, отборы буз сохранения объектов.

Для роботы теста тредуются макеты с данными:
	АО_ДивидендыВыплаты.mxl

Контекст:
	Дано в таблице клиентов тестирования я активизирую строку 'dev4_ПолныеПрава'
	И Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Перехожу в интерфейс Дивиденды выплаты участникам
	И я закрываю все окна клиентского приложения
	И Я использую Интерфейс "Дивиденды, выплаты участникам"
	И я жду открытия формы "Дивиденды, выплаты участникам" в течение 10 секунд

Сценарий: Проверяю элемент интерфейса Объекты Группы
	И Я проверяю ТЧ_ОбъектыГруппы ""

Сценарий: Проверяю отображение данных АО
	И в таблице "ГруппаЛиц" я перехожу к строке
	| 'Объекты участия'    |
	| 'АО Ком организация' |
	И Я проверяю Дивиденды выплаты АО Ком организация

Сценарий: Проверяю отображение данных ЗАО
	И в таблице "ГруппаЛиц" я перехожу к строке
	| 'Объекты участия'     |
	| 'ЗАО Ком организация' |
	И Я проверяю Дивиденды выплаты ЗАО Ком организация
