#language: ru

@tree
@IgnoreOnCIMainBuild

Функционал: Тестирование интерфейса План корпоративные мероприятия в объекте Группы

Как Администратор я открываю командный интерфейс ПланКорпоративныеМероприятия
и провожу проверку на заранее созданных данных.
Проеряю кнопки, сервисы, отборы буз сохранения объектов.

Для роботы теста тредуются макеты с данными:
	ХХХ.mxl
	ХХХ.mxl
	ХХХ.mxl

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
